## 16FEB
### Assignment

### Q1

Q1. What is a database? Differentiate between SQL and NoSQL databases.

In [ ]:
Ans:- A database is a collection of data that is organized in a structured way, so that it can be easily accessed, 
managed, and updated. Databases can be used for a variety of purposes, including storing customer information, 
financial records, inventory data, and much more.

In [ ]:
SQL and NoSQL are two types of database management systems that differ in the way they store and manage data:

=> SQL databases: SQL (Structured Query Language) databases are relational databases that store data in tables, 
which are related to one another using primary and foreign keys. SQL databases are highly structured and require that the data be organized into a fixed schema before it can be stored. SQL databases are ideal for applications that require complex querying and data manipulation, such as financial systems and e-commerce platforms.

=> NoSQL databases: NoSQL (Not Only SQL) databases are non-relational databases that store data in a flexible, 
unstructured format. NoSQL databases are highly scalable and can handle large amounts of data that is constantly 
changing. NoSQL databases are ideal for applications that require real-time data analysis, such as social media 
platforms, gaming apps, and IoT (Internet of Things) devices

In [ ]:
In summary, SQL databases are structured, highly organized, and ideal for complex querying and data manipulation.
NoSQL databases are flexible, scalable, and ideal for real-time data analysis.

### Q2

In [ ]:
Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

In [ ]:
Ans:- DDL stands for Data Definition Language, which is a subset of SQL used to define and modify the structure 
of a database. DDL statements are used to create, modify, and delete database objects such as tables, indexes, 
views, and procedures.

Here are some examples of how the CREATE, DROP, ALTER, and TRUNCATE statements can be used in DDL:

In [ ]:
CREATE: The CREATE statement is used to create a new database object, such as a table, index, or view. 
For example, to create a new table called "customers" with columns for ID, name, and email, the following SQL 
statement can be used:

In [ ]:
CREATE TABLE customers (
   ID INT PRIMARY KEY,
   name VARCHAR(50),
   email VARCHAR(100)
);

In [ ]:
DROP: The DROP statement is used to delete an existing database object. For example, to delete the "customers"
table that was created in the previous example, the following SQL statement can be used:

In [ ]:
DROP TABLE customers;

In [ ]:
ALTER: The ALTER statement is used to modify an existing database object. For example, to add a new column called
"phone" to the "customers" table, the following SQL statement can be used:

In [ ]:
ALTER TABLE customers ADD phone VARCHAR(20);

In [ ]:
TRUNCATE: The TRUNCATE statement is used to delete all the data from an existing table. For example, to delete
all the data from the "customers" table, the following SQL statement can be used:

In [ ]:
TRUNCATE TABLE customers;

In [ ]:
In summary, DDL statements are used to create, modify, and delete database objects, and the CREATE, DROP, ALTER,
and TRUNCATE statements are some of the most commonly used DDL statements in SQL.

### Q3

In [ ]:
Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

In [ ]:
Ans:- DML stands for Data Manipulation Language, which is a subset of SQL used to manage and manipulate the data 
within a database. DML statements are used to insert, update, retrieve, and delete data in a database.

Here are some examples of how the INSERT, UPDATE, and DELETE statements can be used in DML:

In [ ]:
INSERT: The INSERT statement is used to add new data to a table. For example, to insert a new record into a 
table called "employees" with values for the "name", "age", and "salary" columns, the following SQL statement can 
be used:

In [ ]:
INSERT INTO employees (name, age, salary) VALUES ('John Smith', 30, 50000);

In [ ]:
UPDATE: The UPDATE statement is used to modify existing data in a table. For example, to update the salary of an 
employee with ID 1001 to 60000, the following SQL statement can be used:

In [ ]:
UPDATE employees SET salary = 60000 WHERE ID = 1001;

In [ ]:
DELETE: The DELETE statement is used to remove data from a table. For example, to delete all employees with a 
salary less than 40000, the following SQL statement can be used:

In [ ]:
DELETE FROM employees WHERE salary < 40000;

In [ ]:
In summary, DML statements are used to manipulate the data within a database, and the INSERT, UPDATE, and DELETE 
statements are some of the most commonly used DML statements in SQL.

### Q4

In [ ]:
Q4. What is DQL? Explain SELECT with an example.

In [ ]:
Ans:- DQL stands for Data Query Language, which is a subset of SQL used to retrieve data from a database. 
DQL statements are used to search and filter the data in a database.

The SELECT statement is the most commonly used DQL statement, and is used to retrieve data from one or more tables 
in a database. Here's an example of how the SELECT statement can be used in DQL:

Consider the following "students" table, which contains information about students:

In [ ]:
+----+-------+-------+--------+
| ID | Name  | Grade | Gender |
+----+-------+-------+--------+
| 1  | Alice | 95    | F      |
| 2  | Bob   | 82    | M      |
| 3  | Carol | 90    | F      |
| 4  | Dave  | 76    | M      |
+----+-------+-------+--------+

In [ ]:
To retrieve all the data from the "students" table, the following SELECT statement can be used:

In [ ]:
SELECT * FROM students;

In [ ]:
This statement will return all the columns and rows in the "students" table, as shown below:

In [ ]:
+----+-------+-------+--------+
| ID | Name  | Grade | Gender |
+----+-------+-------+--------+
| 1  | Alice | 95    | F      |
| 2  | Bob   | 82    | M      |
| 3  | Carol | 90    | F      |
| 4  | Dave  | 76    | M      |
+----+-------+-------+--------+

In [ ]:
To retrieve only the names of the students from the "students" table, the following SELECT statement can be used:

In [ ]:
SELECT Name FROM students;

In [ ]:
This statement will return only the "Name" column from the "students" table, as shown below:

In [ ]:
+-------+
| Name  |
+-------+
| Alice |
| Bob   |
| Carol |
| Dave  |
+-------+

In [ ]:
In summary, DQL statements are used to retrieve data from a database, and the SELECT statement is the most
commonly used DQL statement in SQL.

### Q5

In [ ]:
Q5. Explain Primary Key and Foreign Key.

In [ ]:
Ans:- Primary Key and Foreign Key are two important concepts in relational databases that are used to establish 
relationships between tables.

A Primary Key is a column or set of columns in a table that uniquely identifies each record in that table.
A Primary Key must have a unique value for each record, and cannot have a null value. The Primary Key is used to
ensure data integrity and to enforce referential integrity when creating relationships with other tables.

For example, consider a "students" table that has an "ID" column as its Primary Key:

In [ ]:
+----+-------+-------+--------+
| ID | Name  | Grade | Gender |
+----+-------+-------+--------+
| 1  | Alice | 95    | F      |
| 2  | Bob   | 82    | M      |
| 3  | Carol | 90    | F      |
| 4  | Dave  | 76    | M      |
+----+-------+-------+--------+

In [ ]:
In this table, the "ID" column is the Primary Key, and ensures that each record is uniquely identified by its ID. 
The Primary Key can also be used to create relationships with other tables, as explained below.

A Foreign Key is a column or set of columns in one table that references the Primary Key of another table. 
A Foreign Key is used to establish relationships between tables, and to enforce referential integrity between 
related tables. The Foreign Key column in a table contains values that match the Primary Key values in the related 
table.

For example, consider a second "enrollments" table that contains information about which students are enrolled in
which courses:

In [ ]:
+---------+------------+
| Student | Course     |
+---------+------------+
| 1       | Math       |
| 1       | Science    |
| 2       | English    |
| 3       | Science    |
| 4       | History    |
+---------+------------+

In [ ]:
In this table, the "Student" column is a Foreign Key that references the "ID" column in the "students" table.
This creates a relationship between the two tables, and ensures that only valid student IDs can be entered into
the "enrollments" table.

In summary, a Primary Key is a column or set of columns in a table that uniquely identifies each record in 
that table, while a Foreign Key is a column or set of columns in one table that references the Primary Key of 
another table. Together, they are used to create relationships between tables and to ensure data integrity in a 
relational database.

### Q6

In [ ]:
Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [ ]:
Ans:- To connect to MySQL from Python, you can use the mysql-connector package. Here's an example code snippet 
that shows how to connect to a MySQL database from Python:

In [ ]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="yourusername",
  password="yourpassword",
  database="yourdatabase"
)

mycursor = mydb.cursor()

In [ ]:
In this code snippet, we import the mysql.connector module and use it to establish a connection to a MySQL
database. We specify the host, user, password, and database parameters to connect to the specific database we 
want to work with. The connect() method returns a connection object, which we store in the mydb variable.

We then create a cursor object using the cursor() method of the connection object. The cursor object is used to 
execute SQL statements and fetch results. The execute() method of the cursor object is used to execute SQL 
statements.

For example, to execute a SELECT statement, we can use the execute() method as follows:

In [ ]:
mycursor.execute("SELECT * FROM customers")
myresult = mycursor.fetchall()
for x in myresult:
print(x)

In [ ]:
In this code snippet, we execute a SELECT statement that retrieves all rows from the "customers" table. 
The fetchall() method is then called on the cursor object to retrieve all the rows returned by the SELECT
statement. The result is stored in the myresult variable, which is then printed using a for loop.

In summary, the cursor() method is used to create a cursor object that is used to execute SQL statements, and the 
execute() method is used to execute SQL statements.

### Q7

In [ ]:
Q7. Give the order of execution of SQL clauses in an SQL query.

In [ ]:
Ans:- The order of execution of SQL clauses in a query is as follows:

=> FROM: This clause specifies the table(s) from which data is being selected.

=> JOIN: If the query involves joining multiple tables, the JOIN clause is used to combine them.

=> WHERE: This clause is used to filter the results based on certain conditions.

=> GROUP BY: This clause is used to group the results based on one or more columns.

=> HAVING: If the query includes a GROUP BY clause, the HAVING clause is used to filter the results based on 
aggregate functions (such as SUM or AVG).

=> SELECT: This clause is used to select the columns that will be displayed in the results.

=> DISTINCT: If the query requires only unique values in the results, the DISTINCT keyword is used.

=> ORDER BY: This clause is used to sort the results based on one or more columns.

=> LIMIT: This clause is used to limit the number of results returned by the query.

In [ ]:
It's important to note that not all SQL queries will include all of these clauses, and the order of 
execution may vary depending on the specific query being executed. However, in general, this is the typical order 
of execution for a basic SQL query.